In [1]:
import numpy as np
import pandas as pd
from io import StringIO

In [8]:

type(jsondf)
jsondf

              name  age  height                job
0        Fiona Lee   45     198             Doctor
1       Ian Taylor   22     198            Teacher
2    Jasmine Clark   54     165    Project Manager
3      Fiona Brown   27     180            Teacher
4    Charlie Clark   48     157     Data Scientist
..             ...  ...     ...                ...
95     Fiona Clark   41     175  Software Engineer
96    George Clark   50     152     Content Writer
97       Ian Davis   51     153  Marketing Manager
98    Bob Williams   35     183     Data Scientist
99  Ethan Anderson   45     154  Marketing Manager

[100 rows x 4 columns]

In [13]:
jsondf

              name  age  height                job
0        Fiona Lee   45     198             Doctor
1       Ian Taylor   22     198            Teacher
2    Jasmine Clark   54     165    Project Manager
3      Fiona Brown   27     180            Teacher
4    Charlie Clark   48     157     Data Scientist
..             ...  ...     ...                ...
95     Fiona Clark   41     175  Software Engineer
96    George Clark   50     152     Content Writer
97       Ian Davis   51     153  Marketing Manager
98    Bob Williams   35     183     Data Scientist
99  Ethan Anderson   45     154  Marketing Manager

[100 rows x 4 columns]

In [34]:
jsonData

'{"name": "Alice Johnson","age": 28,"height": 165,"job": "Software Engineer"}'

In [38]:
jsonData='{"name": "Alice Johnson","age": 28,"height": 165,"job": "Software Engineer"}'

In [40]:
pd.read_json(StringIO(jsonData),orient='index')

                        0
name        Alice Johnson
age                    28
height                165
job     Software Engineer

In [39]:
jsonData

'{"name": "Alice Johnson","age": 28,"height": 165,"job": "Software Engineer"}'